Documents/бит_ИсполнительныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ИсполнительныйЛист</Name>
			<BasedOn>
				<xr:Item>Document.бит_РешениеСуда</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХ</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоИсполнительномуПроизводству</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
				<xr:Item>InformationRegister.ИсторияРаботыСДолжниками</xr:Item>
				<xr:Item>InformationRegister.ИсторияИсполнительныхЛистов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнительногоЛиста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВынесенияРешенияСуда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступленияВЗаконнуюСилу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсполнительногоЛиста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбразованияЗадолженностиОт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбразованияЗадолженностиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоИсполнительнымЛистам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЮридическихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДолгаПоУслугеПоРешениюСуда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаГоспошлиныПоРешениюСуда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПредставительскихРасходовПоРешениюСуда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОДолжника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>История</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ИсковоеЗаявление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОплатыПоИсполнительномуЛисту</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаОплатыКУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаГоспошлины</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПредставительскихРасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаботаССППоИсполнительномуЛисту</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаРейда</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатРейда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИОПриставаПредставителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ответчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ИсторияРаботыСДолжниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРаботыСДолжниками</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРейда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатРейда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИОПриставаИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыПоИсполнительнымЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПоИсполнительнымЛистам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоИсполнительнымЛистам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсполнительныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ИсполнительныйЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияИсполнительныхЛистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИсполнительныхЛистов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаИсполнительногоЛиста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВынесенияРешенияСуда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВступленияВЗаконнуюСилу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОбразованияЗадолженностиОт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОбразованияЗадолженностиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИОДолжника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСудебногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЮридическихДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерИсполнительногоЛиста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыПоИсполнительномуПроизводству.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыПоИсполнительномуПроизводству</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаГоспошлины</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПредставительскихРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаОплатыКУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФИОДолжника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсполнительныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ИсполнительныйЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/бит_ИсполнительныйЛист/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)    
	ДелатьПроводкиПоРегистрамССуммой = Истина;

	Суммы = СуммаДолгаПоУслугеПоРешениюСуда+СуммаГоспошлиныПоРешениюСуда+СуммаПредставительскихРасходовПоРешениюСуда;
	Если Суммы = 0 тогда
		ДелатьПроводкиПоРегистрамССуммой = Ложь;
	КонецЕсли;  
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.ЛицевойСчет);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Организация КАК Организация
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Госпошлина = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000012");
	Представительские = Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000013"); 
	
	ВыборкаДетальныеЗаписи.Следующий();
	Организация = ВыборкаДетальныеЗаписи.Организация;
	
	//Организация = Справочники.Организации.НайтиПоКоду("000000001");
	
	// регистр ИсторияРаботыСДолжниками
	Движения.ИсторияРаботыСДолжниками.Записывать = Истина; 
	ПериодЗаписи = ТекущаяДата();
	Для Каждого ТекСтрокаРаботаССППоИсполнительномуЛисту Из РаботаССППоИсполнительномуЛисту Цикл
		Если ЗначениеЗаполнено(ЛицевойСчет) тогда
			Движение = Движения.ИсторияРаботыСДолжниками.Добавить();
			Движение.Период = ПериодЗаписи;
			Движение.ФизическоеЛицо = ФИОДолжника;
			Движение.ЛицевойСчет = ЛицевойСчет;
			Движение.ДатаРейда = ТекСтрокаРаботаССППоИсполнительномуЛисту.ДатаРейда;
			Движение.РезультатРейда = ТекСтрокаРаботаССППоИсполнительномуЛисту.РезультатРейда;
			Движение.ФИОПриставаИсполнителя = ТекСтрокаРаботаССППоИсполнительномуЛисту.ФИОПриставаПредставителя;   
			ПериодЗаписи = ПериодЗаписи+1;
		КонецЕсли;
		
	КонецЦикла;
	
	// регистр СтатусыПоИсполнительнымЛистам
	
	//	//+bit_semenov.v_07.02.2022
	//Процедура установки статуса размещена в модуле менеджера РегистрыСведений.СтатусыПоИсполнительнымЛистам
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//|	СтатусыПоИсполнительнымЛистамСрезПоследних.ИсполнительныйЛист КАК Регистратор,
	//|	СтатусыПоИсполнительнымЛистамСрезПоследних.СтатусДокумента КАК СтатусДокумента
	//|ИЗ
	//|	РегистрСведений.СтатусыПоИсполнительнымЛистам.СрезПоследних(, ИсполнительныйЛист = &Регистратор) КАК СтатусыПоИсполнительнымЛистамСрезПоследних";
	//Запрос.УстановитьПараметр("Регистратор",ЭтотОбъект.Ссылка);
	//Результат = Запрос.Выполнить().Выбрать();
	//Если Результат.Следующий() Тогда
	//	Если Результат.СтатусДокумента <> Статус Тогда
	//		Набор = РегистрыСведений.СтатусыПоИсполнительнымЛистам.СоздатьНаборЗаписей();
	//		//+bit_semenov.v_07.02.2022
	//		//Набор.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	//		Набор.Отбор.ИсполнительныйЛист.Установить(ЭтотОбъект.Ссылка);
	//		//+bit_semenov.v_07.02.2022
	//		Движение = Набор.Добавить();
	//		Движение.ИсполнительныйЛист = ЭтотОбъект.Ссылка;
	//		Движение.Период = ТекущаяДата();
	//		Движение.СтатусДокумента = Статус;
	//		Набор.Записать(Ложь);
	//	КонецЕсли;
	//Иначе
	//	Набор = РегистрыСведений.СтатусыПоИсполнительнымЛистам.СоздатьНаборЗаписей();
	//	Движение = Набор.Добавить();
	//	//Движение.Регистратор = ЭтотОбъект.Ссылка;
	//	Движение.ИсполнительныйЛист = ЭтотОбъект.Ссылка;
	//	Движение.Период = ТекущаяДата();
	//	Движение.СтатусДокумента = Статус;
	//КонецЕсли;
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(ЭтотОбъект.Ссылка);
	РегистрыСведений.СтатусыПоИсполнительнымЛистам.УстановитьСтатусыДокументов(МассивДокументов, Статус);
	//-bit_semenov.v_07.02.2022
	
	// регистр ИсторияИсполнительныхЛистов
	Движения.ИсторияИсполнительныхЛистов.Записывать = Истина;
	Движение = Движения.ИсторияИсполнительныхЛистов.Добавить();
	Движение.Период = Дата;
	Движение.ТипСудебногоДокумента = ВидДокумента;
	Движение.НомерИсполнительногоЛиста = НомерИсполнительногоЛиста;
	Движение.ДатаИсполнительногоЛиста = ДатаИсполнительногоЛиста;
	Движение.ДатаВынесенияРешенияСуда = ДатаВынесенияРешенияСуда;
	Движение.ДатаВступленияВЗаконнуюСилу = ДатаВступленияВЗаконнуюСилу;
	Движение.Услуга = Услуга;
	Движение.ФИОДолжника = ФИОДолжника;
	Движение.Адрес = ""+ЛицевойСчет.Здание +" "+ЛицевойСчет.Квартира;
	Движение.ЛицевойСчет = ЛицевойСчет;
	Движение.ПериодОбразованияЗадолженностиОт = ПериодОбразованияЗадолженностиОт;
	Движение.ПериодОбразованияЗадолженностиПо = ПериодОбразованияЗадолженностиПо;
	
	//
	//// регистр ВзаиморасчетыПоИсполнительномуПроизводству Расход
	//Движения.ВзаиморасчетыПоИсполнительномуПроизводству.Записывать = Истина;
	//Для Каждого ТекСтрокаОплатыПоИсполнительномуЛисту Из ОплатыПоИсполнительномуЛисту Цикл
	//	Движение = Движения.ВзаиморасчетыПоИсполнительномуПроизводству.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Дата;
	//	Движение.ЛицевойСчет = ЛицевойСчет;
	//	Движение.ФИОДолжника = ФИОДолжника;
	//	Движение.Услуга = Услуга;
	//	Движение.Сумма = ТекСтрокаОплатыПоИсполнительномуЛисту.Сумма;
	//	Движение.СуммаГоспошлины = ТекСтрокаОплатыПоИсполнительномуЛисту.СуммаГоспошлины;
	//	Движение.СуммаПредставительскихРасходов = ТекСтрокаОплатыПоИсполнительномуЛисту.СуммаПредставительскихРасходов;
	//	Движение.ГруппаОплатыКУ = ТекСтрокаОплатыПоИсполнительномуЛисту.ГруппаОплатыКУ;
	//	Движение.ДатаОплаты = ДатаИсполнительногоЛиста;
	//КонецЦикла;
	Если ДелатьПроводкиПоРегистрамССуммой Тогда
		// регистр ВзаиморасчетыПоИсполнительномуПроизводству Приход
		Движения.ВзаиморасчетыПоИсполнительномуПроизводству.Записывать = Истина;
		//Для Каждого ТекСтрокаОплатыПоИсполнительномуЛисту Из ОплатыПоИсполнительномуЛисту Цикл
		Движение = Движения.ВзаиморасчетыПоИсполнительномуПроизводству.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ИсполнительныйЛист = Ссылка;
		Движение.ЛицевойСчет = ЛицевойСчет;
		Движение.ФИОДолжника = ФИОДолжника;
		Движение.Услуга = Услуга;
		Движение.Сумма = СуммаДолгаПоУслугеПоРешениюСуда;
		Движение.СуммаГоспошлины = СуммаГоспошлиныПоРешениюСуда;
		Движение.СуммаПредставительскихРасходов = СуммаПредставительскихРасходовПоРешениюСуда;
		Движение.ДатаОплаты = ДатаИсполнительногоЛиста;
		//КонецЦикла;
		
		НачисленияПоУслугамЖКХ(Госпошлина, Представительские, Организация);
		//НачисленияПоУслугамЖКХпоПериодам(Госпошлина, Представительские);
	КонецЕсли;
КонецПроцедуры

//Движения регистра "бит_НачисленияПоУслугамЖКХ"
&НаСервере
Процедура НачисленияПоУслугамЖКХ(пГоспошлина, пПредставительские, пОрганизация)
	Движения.бит_НачисленияПоУслугамЖКХ.Записывать = Истина;
	Движения.бит_НачисленияПоУслугамЖКХПоПериоду.Записывать = Истина;
	
	// Госпошлина Приход                         
	Если СуммаГоспошлиныПоРешениюСуда<>0 тогда
		Движение = Движения.бит_НачисленияПоУслугамЖКХ.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.УслугаЖКХ = пГоспошлина;
		Движение.ЛицевойСчет = ЛицевойСчет;
		Движение.Сумма = СуммаГоспошлиныПоРешениюСуда;
		Движение.Организация = пОрганизация;
	КонецЕсли;
	
	// Представительские Приход    
	Если СуммаПредставительскихРасходовПоРешениюСуда<>0 тогда
		Движение = Движения.бит_НачисленияПоУслугамЖКХ.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.УслугаЖКХ = пПредставительские;
		Движение.ЛицевойСчет = ЛицевойСчет;
		Движение.Сумма = СуммаПредставительскихРасходовПоРешениюСуда;
		Движение.Организация = пОрганизация;                     
	КонецЕсли;


	//бит_НачисленияПоУслугамЖКХПоПериоду
	
	Если ЗначениеЗаполнено(ДатаВынесенияРешенияСуда) тогда 
		МесяцВзаиморасчетов = ДатаВынесенияРешенияСуда;
	ИначеЕсли ЗначениеЗаполнено(ДатаИсполнительногоЛиста) тогда
		МесяцВзаиморасчетов = ДатаИсполнительногоЛиста;
	иначе
		МесяцВзаиморасчетов = Дата;
	КонецЕсли;
	
	Если МесяцВзаиморасчетов < бит_НачисленияЖКХ.МинимальныйПериодОплаты() тогда 
		 МесяцВзаиморасчетов = бит_НачисленияЖКХ.МинимальныйПериодОплаты();
	ИначеЕсли МесяцВзаиморасчетов > бит_НачисленияЖКХ.МаксимальныйПериодОплаты() тогда
		 МесяцВзаиморасчетов = Дата;
	КонецЕсли;
	
	// Госпошлина Приход
	Если СуммаГоспошлиныПоРешениюСуда<>0 тогда
		Движение = Движения.бит_НачисленияПоУслугамЖКХПоПериоду.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.УслугаЖКХ = пГоспошлина;
		Движение.ЛицевойСчет = ЛицевойСчет;
		Движение.Сумма = СуммаГоспошлиныПоРешениюСуда;
		Движение.Организация = пОрганизация; 
		Движение.ПериодВзаиморасчетов = КонецМесяца(МесяцВзаиморасчетов);
	КонецЕсли;
	
	// Представительские Приход
	Если СуммаПредставительскихРасходовПоРешениюСуда<>0 тогда
		Движение = Движения.бит_НачисленияПоУслугамЖКХПоПериоду.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.УслугаЖКХ = пПредставительские;
		Движение.ЛицевойСчет = ЛицевойСчет;
		Движение.Сумма = СуммаПредставительскихРасходовПоРешениюСуда;
		Движение.Организация = пОрганизация;
		Движение.ПериодВзаиморасчетов = КонецМесяца(МесяцВзаиморасчетов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.бит_РешениеСуда") Тогда
		// Заполнение шапки
		Адрес = ДанныеЗаполнения.Адрес;
		СуммаГоспошлиныПоРешениюСуда = ДанныеЗаполнения.Госпошлина;
		ДатаВступленияВЗаконнуюСилу = ДанныеЗаполнения.ДатаВступленияВЗаконнуюСилу;
		ДатаВынесенияРешенияСуда = ДанныеЗаполнения.ДатаВынесенияРешенияСуда;
		ЛицевойСчет = ДанныеЗаполнения.ЛицевойСчет;
		ПериодОбразованияЗадолженностиОт = ДанныеЗаполнения.ПериодОбразованияЗадолженностиОт;
		ПериодОбразованияЗадолженностиПо = ДанныеЗаполнения.ПериодОбразованияЗадолженностиПо;
		СуммаПредставительскихРасходовПоРешениюСуда = ДанныеЗаполнения.ПредставительскиеРасходы;
		СуммаДолгаПоУслугеПоРешениюСуда = ДанныеЗаполнения.СуммаЗадолженности;
		ВидДокумента = ДанныеЗаполнения.ТипДокумента;
		Услуга = ДанныеЗаполнения.Услуга;
		Заявление = ДанныеЗаполнения.Заявление;
		Для Каждого ТекСтрокаОтветчики Из ДанныеЗаполнения.Ответчики Цикл
			НоваяСтрока = Ответчики.Добавить();
			НоваяСтрока.ФизЛицо = ТекСтрокаОтветчики.ФизЛицо;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Ссылка.Пустая() ИЛИ НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = ПользователиКлиентСервер.ТекущийПользователь(); 
	КонецЕсли; 
		
	Если ОбменДанными.Загрузка = ложь и РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		//Проверка заполнения   
		Если не ЗначениеЗаполнено(Услуга) тогда
			Отказ = Истина;	
			Сообщить("Не заполнена услуга");
		КонецЕсли;
		
		Если не ЗначениеЗаполнено(ЛицевойСчет) тогда
			Отказ = Истина;	
			Сообщить("Не заполнен лицевой счет");
		КонецЕсли;  
		//Суммы = СуммаДолгаПоУслугеПоРешениюСуда+СуммаГоспошлиныПоРешениюСуда+СуммаПредставительскихРасходовПоРешениюСуда;
		//Если Суммы=0 тогда
		//	Отказ = Истина;	
		//	Сообщить("Сумма по исполнительному листу не должна быть равна 0!");
		//КонецЕсли;  

	КонецЕсли;

КонецПроцедуры

////Движения регистра "бит_НачисленияПоУслугамЖКХПоПериоду"
//&НаСервере
//Процедура НачисленияПоУслугамЖКХпоПериодам(пГоспошлина, пПредставительские)
//	
//	 Госпошлина Приход
//	Движения.бит_НачисленияПоУслугамЖКХПоПериоду.Записывать = Истина;
//	Движение = Движения.бит_НачисленияПоУслугамЖКХПоПериоду.Добавить();
//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//	Движение.Период = Дата;
//	Движение.УслугаЖКХ = пГоспошлина;
//	Движение.ЛицевойСчет = ЛицевойСчет;
//	Движение.Сумма = СуммаГоспошлиныПоРешениюСуда;
//	Движение.Организация = Организация;
//	Движение.ПериодВзаиморасчетов = ЭтотОбъект.ПериодОбразованияЗадолженностиОт;
//	
//	 Представительские Приход
//	Движения.бит_НачисленияПоУслугамЖКХПоПериоду.Записывать = Истина;
//	Движение = Движения.бит_НачисленияПоУслугамЖКХПоПериоду.Добавить();
//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//	Движение.Период = Дата;
//	Движение.УслугаЖКХ = пПредставительские;
//	Движение.ЛицевойСчет = ЛицевойСчет;
//	Движение.Сумма = СуммаПредставительскихРасходовПоРешениюСуда;
//	Движение.Организация = Организация;
//	Движение.ПериодВзаиморасчетов = ЭтотОбъект.ПериодОбразованияЗадолженностиОт;
//	
//	}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
//КонецПроцедуры;
